{
   "profile": {
      "email": "arifuzzaman.tanin@outlook.com",
      "phone": "+1 (437) 460-9212"
   },
   "achievements": [
      "IOT Certification: 4-Month Training under LICT, Bangladesh Government",
      "Hacker Rank Problem Solving (Intermediate) Certification",
      "Hacker Rank JavaScript (Intermediate) Certification",
      "Hacker Rank JavaScript (Basic) Certification",
      "Hacker Rank SQL (Advanced) Certification",
      "Rest API (Intermediate) Certificate",
      "National Hackathon Runners up 2014"
   ],
   "skills": [
      {
         "name": "C#(ASP.NET, ASP.NET Core)",
         "achieved": "80"
      },
      {
         "name": "Database(MSSQL, MySQL, Postgres, Oracle, NoSQL)",
         "achieved": "80"
      },
      {
         "name": "PHP(Laravel, Eloquent)",
         "achieved": "80"
      },
      {
         "name": "MVC, API(Restfull, Rest API)",
         "achieved": "80"
      },
      {
         "name": "JavaScript(Vue.js, JQuery, Angular)",
         "achieved": "70"
      },
      {
         "name": "Docker",
         "achieved": "60"
      },
      {
         "name": "Azure, AWS",
         "achieved": "60"
      },
      {
         "name": "Version Control(Git)",
         "achieved": "80"
      },
      {
         "name": "Design Pattern",
         "achieved": "70"
      },
      {
         "name": "HTML, CSS",
         "achieved": "65"
      },
      {
         "name": "Project Management",
         "achieved": "80"
      },
      {
         "name": "Competitive Programming",
         "achieved": "80"
      },
      {
         "name": "Cache(Redis)",
         "achieved": "80"
      },
      {
         "name": "Microservices",
         "achieved": "80"
      }
   ],
   "workExperiences": [
      {
         "company": {
            "name": "SKILL QUOTIENT RESOURCES SDN BHD (ON BOARDED AT PETRONAS - IT’S A LARGEST OIL & GAS COMPANY IN MALAYSIA)",
            "contact": [
               {
                  "website": "https://skillquotient.net/",
                  "logo": "https://raw.githubusercontent.com/arifuzzaman-tanin/arifuzzaman-tanin-resume/main/assets/images/skillquotient-logo.png"
               },
               {
                  "website": "https://www.petronas.com/",
                  "logo": "https://raw.githubusercontent.com/arifuzzaman-tanin/arifuzzaman-tanin-resume/main/assets/images/petronas-logo.jpg"
               }
            ]
         },
         "position": "Software Engineer",
         "jobType": "Contractual",
         "duration": "November 2022 To Present",
         "location": "Toronto, Canada",
         "responsibilities": [
            "A microservices project using C#, .NET Core, Azure, and more, improving scalability by 20%.",
            "Engineered a system analyzing oil and gas extraction costs, cutting expenses by 15%.",
            "Coordinated with the Technical Director, ensuring project alignment and efficiency gains of 25%.",
            "Actively collaborated with programmers, enhancing project efficiency by 25%.",
            "Innovated within the R&D team, contributing to the project's technological advancement.",
            "Optimized Entity Framework Core, boosting database query speed by 25%.",
            "Implemented CI/CD pipelines, cutting deployment time by 40%."
         ]
      },
      {
         "company": {
            "name": "EXABYTING LIMITED (ON BOARDED AT BKASH- IT’S A LARGEST FINTECH COMPANY IN BANGLADESH)",
            "contact": [
               {
                  "website": "https://exabyting.com/",
                  "logo": "https://raw.githubusercontent.com/arifuzzaman-tanin/arifuzzaman-tanin-resume/f41f7ad1c065791ca9967a36ee3ae5ba9246f4e2/assets/images/exabyting-logo.svg"
               },
               {
                  "website": "https://www.bkash.com/en",
                  "logo": "https://raw.githubusercontent.com/arifuzzaman-tanin/arifuzzaman-tanin-resume/main/assets/images/bkash-logo.png"
               }
            ]
         },
         "position": "Software Engineer",
         "jobType": "Contractual",
         "duration": "July 2021 To Nov 2022",
         "location": "Bangladesh - Remote",
         "responsibilities": [
            "Contributed to the development of a dynamic fintech internal app in a collaborative team setting, utilizing technologies like C#, .NET Core, MVC, Web API, MSSQL, Entity Framework, Dapper, Microservices, Redis, PHP (Laravel), MySQL, JavaScript, Angular, Vue.js, jQuery, JSON, AJAX, XML, HTML, and CSS.",
            "Played a key role in improving application responsiveness by 30% through the adoption of microservices architecture.",
            "Actively collaborated with cross-functional teams, contributing to a 15% reduction in development time.",
            "Participated in the implementation of Vue.js and Angular, contributing to a 25% increase in user satisfaction.",
            "Contributed to the implementation of robust security measures, resulting in a 40% decrease in security-related incidents.",
            "Played a role in conducting PHP (Laravel) and Angular training sessions, reducing onboarding time by 30%."
         ]
      },
      {
         "company": {
            "name": "SIM SOLUTION LIMITED",
            "contact": [
               {
                  "website": "#",
                  "logo": "https://raw.githubusercontent.com/arifuzzaman-tanin/arifuzzaman-tanin-resume/main/assets/images/sim-solution-logo.png"
               }
            ]
         },
         "position": "Software Engineer",
         "jobType": "Fulltime",
         "duration": "October 2017 To June 2021",
         "location": "Bangladesh",
         "responsibilities": [
            "E-commerce and Real Estate Solutions: Engineered tailored software solutions for e-commerce and real estate industries, optimizing processes and boosting operational efficiency.",
            "Human Resource Management System: Designed and implemented a comprehensive HR software system, streamlining HR processes and elevating workforce management.",
            "Developed a state-of-the-art health care system, facilitating remote medical consultations and enhancing healthcare delivery",
            "Increased accessibility to healthcare services by 30%, contributing to efficient medical consultations.",
            "Created a digital document archiving system, ensuring secure storage and seamless retrieval of essential records.",
            "Improved document retrieval speed by 25%, enhancing overall operational efficiency.",
            "Technologies Utilized in SIM SOLUTION LIMITED: Applied a diverse tech stack including ASP.NET, ASP.NET MVC, Web API, Entity Framework, ADO.NET, MSSQL, React JS, PHP (Laravel), MySQL, JavaScript, Angular, Vue.js, jQuery, JSON, AJAX, XML, HTML, and CSS."
         ]
      },
      {
         "company": {
            "name": "PRIMEASIA UNIVERSITY",
            "contact": [
               {
                  "website": "https://www.primeasia.edu.bd/",
                  "logo": "https://raw.githubusercontent.com/arifuzzaman-tanin/arifuzzaman-tanin-resume/main/assets/images/primeasia-university-logo.png"
               }
            ]
         },
         "position": "Software Engineer",
         "jobType": "Fulltime",
         "duration": "February 2017 To October 2017",
         "location": "Bangladesh",
         "responsibilities": [
            "Developed a university management system.",
            "Crafted a robust university management system tailored for Primeasia University, marking my first post-graduation venture.",
            "Optimized student information management, learning to improve data retrieval efficiency by 20%.",
            "Streamlined course and curriculum management, gaining insights into reducing administrative workload by 15%.",
            "Acquired proficiency in ASP.NET, MVC, Web API, and a versatile tech stack during the project.",
            "Enhanced collaborative development skills using GitHub and project management tool."
         ]
      }
   ],
   "projects": [
      {
         "name": "Concept Factory (CF++)",
         "description": "Currently developing a mission-critical application for Petronas, Malaysia's premier oil and gas company, with the primary goal of analyzing mining costs. This ongoing project involves the implementation of advanced tools for real-time cost assessment, resource allocation optimization, and predictive maintenance, aimed at helping Petronas make informed decisions and maximize cost-efficiency in their mining operations.",
         "technology": [
            ".NET Core API",
            "MSSQL",
            "Microservice",
            "Azure"
         ]
      },
      {
         "name": "Telemedicine - (Frontend)",
         "description": "Developed and implemented secure, compliant features for Provident Health Care, enabling remote consultations, secure medical data sharing, e-prescriptions, and remote monitoring. These essential functionalities significantly reduced the need for in-person visits, enhancing overall patient experience and healthcare accessibility.",
         "technology": [
            "Vue JS"
         ]
      },
      {
         "name": "Next e-commerce",
         "description": "Contributed to the development of Next e-commerce, an online platform with key features including user-friendly product navigation, secure payment processing, inventory management, and an intuitive shopping cart system, optimizing the online shopping experience for customers.",
         "technology": [
            "Laravel",
            "Vue JS",
            "MySQL",
            "Redis"
         ]
      },
      {
         "name": "EME Records (Bangladesh Army)",
         "description": "EME Records, implemented for the Bangladesh Army, stands as a comprehensive automation solution for military management and document archiving. This robust system streamlines and enhances the efficiency of various administrative and archival processes within the military domain.",
         "technology": [
            "ASP.NET MVC",
            "Web API 2",
            "JavaScript",
            "MSSQL"
         ]
      },
      {
         "name": "University Management System (Primeasia University)",
         "description": "Developed a University Management System for Primeasia University, incorporating essential features such as student enrollment and records management, course scheduling, faculty and staff administration, automated grading, and academic performance tracking. Designed and implemented a user-friendly portal customized for Primeasia University, fostering efficient communication and streamlined academic operations within the institution.",
         "technology": [
            "ASP.NET MVC",
            "Web API 2",
            "JavaScript",
            "MSSQL"
         ]
      },
      {
         "name": "HR & Payroll",
         "description": "Contributed to the development of an HR & Payroll system with core features including employee information management, biometric attendance tracking, leave management, automated payroll processing, and tax compliance. Designed and implemented a user-friendly interface for HR professionals, ensuring accurate and efficient HR and payroll operations, while maintaining compliance with regulatory requirements.",
         "technology": [
            "ASP.NET",
            "JavaScript",
            "MSSQL",
            "Fingerprint scanner (zkteco)"
         ]
      },
      {
         "name": "Vat Management System",
         "description": "Designed and developed a Vat Management System with a focus on automated tax calculation, efficient invoice processing, real-time compliance monitoring, and reporting capabilities. Implemented features to streamline tax filing, reduce errors, and ensure accurate financial records for businesses, optimizing tax management processes.",
         "technology": [
            "ASP.NET MVC",
            "Web API 2",
            "JavaScript",
            "MSSQL"
         ]
      },
      {
         "name": "Real-Estate Marketplace",
         "description": "Contributed to the development of a Real-Estate Marketplace with key features, including property listing and search functionality, user profiles with saved searches, and real-time notifications. Implemented a user-friendly interface for buyers and sellers, optimizing the property buying and selling experience.",
         "technology": [
            "ASP.NET MVC",
            "Web API 2",
            "JavaScript",
            "MSSQL",
            "Redis",
            "Google Map Service"
         ]
      },
      {
         "name": "bKash Website",
         "description": "Engineered a robust CMS to empower bKash with the ability to manage and update content dynamically, ensuring a user-friendly and up-to-date online presence. bKash stands as a significant milestone in the realm of mobile financial services in Bangladesh. Operating under the authority of Bangladesh Bank as a subsidiary of BRAC Bank Limited, bKash has emerged as a pioneer in facilitating seamless and secure financial transactions through mobile devices.",
         "technology": [
            "Laravel",
            "Vue JS",
            "MySQL",
            "Redis"
         ]
      }
   ]
}